##
# Homebrew Setup
##
brew "wget"
brew "node"

##
# Brew Cask for UI Apps
##
tap "homebrew/cask"
cask_args appdir: "/Applications"

# Browsers
cask "google-chrome"
brew "chrome-cli"
cask "firefox"

# Development
cask "webstorm"
cask "pycharm-ce"
cask "sublime-text"
cask "visual-studio-code"

# Messaging
cask "goofy"
cask "slack"

# Productivity
cask "notion"
cask "lastpass"
mas "Todoist", id: 585829637

# OS
cask "bettertouchtool"
cask "loom"
mas "Screenie", id: 965442961

# Entertainment
cask "spotify"
cask "steam"

# Design
cask "figma"

# Music
cask "splice"
mas "Logic Pro X", id: 634148309

# Misc.

